app/views/groups/index.html.erb

                            <span class="delete-checkbox"><%= check_box_tag("delete[#{group.id}]", "1") %></span>
                            <%= link_to(group.group_name, "/groups/" + group.id.to_s) %>
---
SELECT "groups".* FROM "groups"