app/views/matches/show.html.erb

SELECT "groups".* FROM "groups"
---
        <td><%= index %></td>
        <td><%= @matches[index].group_name %></td>