app/controllers/groups_controller.rb

    def index
        @groups = Group.all.sort_by {|group| group.group_name.to_i}
---
SELECT "groups".* FROM "groups"

    def destroy_multiple
        begin
            Group.find(params[:delete].keys).each do |group|
                group.destroy
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]