app/controllers/matches_controller.rb

    def show
        @matches = Match.all.sort_by { |each| (each.group_name.to_i) }
---
SELECT "groups".* FROM "groups" WHERE "groups"."group_name" IS NULL
SELECT "matches".* FROM "matches"