app/controllers/projects_controller.rb

INSERT INTO "projects" ("project_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["project_name", "Bob's Bakery"], ["created_at", "2016-11-17 09:59:53.589622"], ["updated_at", "2016-11-17 09:59:53.589622"]]
---
    def new
        if params.key?(:project_name)
            name = params[:project_name]
            project = Project.create(project_name: name)